cfMeshTest/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottomEmptyFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          50195;
        startFace       99813;
    }
    topEmptyFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          50195;
        startFace       150008;
    }
    inlet
    {
        type            patch;
        nFaces          164;
        startFace       200203;
    }
    outlet
    {
        type            patch;
        nFaces          53;
        startFace       200367;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1964;
        startFace       200420;
    }
    symmetryLine
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          330;
        startFace       202384;
    }
)

// ************************************************************************* //
